Revit 2026 API

# ExternallyTaggedGeometryValidation Methods

---

The ExternallyTaggedGeometryValidation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsNonSolid | Makes sure that the input geometry object is not a Solid. |
|  | IsSolid | Makes sure that the input geometry object is a Solid. |
|  | LacksSubnodes | Makes sure that the input geometry object does not have sub-nodes. |

#### Reference

ExternallyTaggedGeometryValidation Class

Autodesk.Revit.DB Namespace